import json 
from src.tk_openai_sdk_agent.utils.utils import fomart_rsp_str
from src.tk_openai_sdk_agent.models.models import Response
  
test1 =  '''


[  
  {  
    "IP称呼": "王者",  
    "角色名称": "西施",  
    "IP官方名称": "王者荣耀"  
  },  
  {  
    "IP称呼": "三丽鸥骑士",  
    "角色名称": "卢塔尔·斯特拉",  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "崩坏:星穹铁道",  
    "角色名称": "大黑塔",  
    "IP官方名称": "崩坏：星穹铁道"  
  },  
  {  
    "IP称呼": "刀剑神域",  
    "角色名称": "Alo妖精桐人",  
    "IP官方名称": "刀剑神域"  
  },  
  {  
    "IP称呼": "星学院",  
    "角色名称": "菲洛",  
    "IP官方名称": "星学院"  
  },  
  {  
    "IP称呼": "艾雅法拉",  
    "角色名称": "明日方舟",  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "世界计划",  
    "角色名称": "东云彰人",  
    "IP官方名称": "世界计划 彩色舞台 feat. 初音未来"  
  },  
  {  
    "IP称呼": "无敌破坏王",  
    "角色名称": "云妮洛普",  
    "IP官方名称": "无敌破坏王"  
  },  
  {  
    "IP称呼": "盗墓笔记",  
    "角色名称": "禁婆（霍玲）",  
    "IP官方名称": "盗墓笔记"  
  },  
  {  
    "IP称呼": "Jojo的奇妙冒险",  
    "角色名称": "杰洛·齐贝林",  
    "IP官方名称": "JOJO的奇妙冒险"  
  },  
  {  
    "IP称呼": "第五人格",  
    "角色名称": "蚀日者",  
    "IP官方名称": "第五人格"  
  },  
  {  
    "IP称呼": "石纪元",  
    "角色名称": "千空",  
    "IP官方名称": "Dr.STONE 新石纪"  
  },  
  {  
    "IP称呼": "鬼灭之刃",  
    "角色名称": "香奈乎",  
    "IP官方名称": "鬼灭之刃"  
  },  
  {  
    "IP称呼": "叛逆的鲁鲁修",  
    "角色名称": "尤菲米亚",  
    "IP官方名称": "反叛的鲁路修"  
  },  
  {  
    "IP称呼": "饿殍·明末千里行",  
    "角色名称": "满穗",  
    "IP官方名称": "饿殍：明末千里行"  
  },  
  {  
    "IP称呼": "魔法少女小樱",  
    "角色名称": "大道寺知世",  
    "IP官方名称": "魔卡少女樱"  
  },  
  {  
    "IP称呼": "王者荣耀-弈星-踏雪寻梅",  
    "角色名称": null,  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "变身偶像公主",  
    "角色名称": "学森苹果",  
    "IP官方名称": "变身！公主偶像"  
  },  
  {  
    "IP称呼": "王者荣耀-曜李逍遥",  
    "角色名称": null,  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "第五人格-入殓师盲区",  
    "角色名称": null,  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "异形舞台",  
    "角色名称": "Luca",  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "拳皇",  
    "角色名称": "库拉",  
    "IP官方名称": "THE KING OF FIGHTERS"  
  },  
  {  
    "IP称呼": "永劫无间-殷紫萍天禄瑞光",  
    "角色名称": null,  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "狂赌之渊",  
    "角色名称": "桃喰绮罗莉",  
    "IP官方名称": "狂赌之渊"  
  },  
  {  
    "IP称呼": "Ow-Dva",  
    "角色名称": null,  
    "IP官方名称": "守望先锋"  
  },  
  {  
    "IP称呼": "英雄联盟/双城之战",  
    "角色名称": "金克丝",  
    "IP官方名称": "双城之战"  
  },  
  {  
    "IP称呼": "我在精神病院学斩神",  
    "角色名称": "安卿鱼",  
    "IP官方名称": "我在精神病院学斩神"  
  },  
  {  
    "IP称呼": "妖精的尾巴",  
    "角色名称": "米拉珍",  
    "IP官方名称": "FAIRY TAIL 魔导少年"  
  },  
  {  
    "IP称呼": "Jojo的奇妙冒险",  
    "角色名称": "玛莱雅",  
    "IP官方名称": "JOJO的奇妙冒险"  
  },  
  {  
    "IP称呼": "绝区零",  
    "角色名称": "月城柳",  
    "IP官方名称": "绝区零"  
  },  
  {  
    "IP称呼": "末日三问",  
    "角色名称": "珂朵莉",  
    "IP官方名称": "末日时在做什么？有没有空？可以来拯救吗？"  
  },  
  {  
    "IP称呼": "属性咖啡厅",  
    "角色名称": "夏帆",  
    "IP官方名称": "调教咖啡厅"  
  },  
  {  
    "IP称呼": "鬼灭之刃",  
    "角色名称": "汉服甘露寺蜜璃",  
    "IP官方名称": "鬼灭之刃"  
  },  
  {  
    "IP称呼": "明日方舟",  
    "角色名称": "流明",  
    "IP官方名称": "明日方舟"  
  },  
  {  
    "IP称呼": "Fate系列",  
    "角色名称": "阿尔托莉雅•潘德拉贡alter",  
    "IP官方名称": "Fate系列"  
  },  
  {  
    "IP称呼": "东方",  
    "角色名称": "博丽灵梦",  
    "IP官方名称": "东方Project"  
  },  
  {  
    "IP称呼": "原神",  
    "角色名称": "霄宫",  
    "IP官方名称": "原神"  
  },  
  {  
    "IP称呼": "王者荣耀-小乔音你心动",  
    "角色名称": null,  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "原神",  
    "角色名称": "萍姥姥",  
    "IP官方名称": "原神"  
  },  
  {  
    "IP称呼": "无限暖暖",  
    "角色名称": "苏暖暖",  
    "IP官方名称": "无限暖暖"  
  },  
  {  
    "IP称呼": "第五人格-医生 永生花",  
    "角色名称": null,  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "名侦探柯南",  
    "角色名称": "宫野志保",  
    "IP官方名称": "名侦探柯南"  
  },  
  {  
    "IP称呼": "迪士尼长发公主",  
    "角色名称": "乐佩",  
    "IP官方名称": "魔发奇缘"  
  },  
  {  
    "IP称呼": "初音未来",  
    "角色名称": "恋色病栋",  
    "IP官方名称": "初音未来"  
  },  
  {  
    "IP称呼": "缄默货运",  
    "角色名称": "安雅",  
    "IP官方名称": "未知"  
  },  
  {  
    "IP称呼": "颂乐人偶",  
    "角色名称": "祐天寺若麦",  
    "IP官方名称": "【我推的孩子】"  
  },  
  {  
    "IP称呼": "剑网三",  
    "角色名称": "炮萝",  
    "IP官方名称": "剑侠情缘网络版叁"  
  },  
  {  
    "IP称呼": "银魂",  
    "角色名称": "巳厘野道满",  
    "IP官方名称": "银魂"  
  },  
  {  
    "IP称呼": "第五人格-病患湖中影",  
    "角色_@#ai_model=DEEPSEEK-R1'''
    
ai_model = 'DEEPSEEK-R1'
json_str = fomart_rsp_str(test1)
json_r1 = json.loads(json_str)
formated = [Response(**{**item,'ai_model':ai_model}) for item in json_r1]
